[
    {
        "label": "0",
        "sentence": [
            " 算法结构：所用操作和执行顺序决定。基本控制结构：顺序、分支、循环。任何复杂算法都可由基本结构组合而成。",
            " 顺序结构是算法中一种基本控制结构,表示操作按照先后顺序执行。每个步骤必须按顺序执行,且每个步骤只执行一次。",
            " 选择结构是算法的基本控制结构之一，根据条件选择执行不同操作分支。有单分支、双分支和多分支三种形式，常用于算法设计。",
            " 缩减后的结果：算法中的循环结构包括当型和直到型，必须设置合理的循环条件避免死循环。",
            " 算法包含三种控制结构，分别对应Python的3种语句结构：顺序、选择、循环。通过它们的组合可以实现各种算法。",
            " 本节介绍了Python中的顺序结构程序，即逐行执行。通过两个示例演示了计算BMI值和解决'鸡兔同笼'问题。指出了语句顺序可调整，但有些不能改变。",
            " Python中的if语句实现选择结构，根据条件执行不同代码分支。有单、双和多三种格式，对应不同选择结构。条件为True执行对应语句块，为False则不执行。",
            " Python if语句在不同场景中的应用：学生成绩输出、BMI值判断身体状况、蝈蝈蜘蛛数量、身高判断游乐项目。",
            " 本节介绍了Python中循环结构的两种形式: for语句和while语句。for语句遍历序列实现计数循环，while语句用于条件循环。可以实现重复操作，提高编程效率。",
            " 介绍了Python中while语句的使用,以及与for语句的异同。while适用于条件循环,判断条件表达式是否满足来决定循环是否继续。同时介绍了for和while循环的嵌套使用,以及循环控制语句break和continue的作用。循环结构为实现复杂的程序逻辑提供支撑。",
            " Python中break和continue语句在循环控制中的作用。break语句用于直接退出整个循环,而continue语句仅退出本次循环,返回到循环起始处进行下一次迭代。这些循环控制语句提供了更灵活的程序流程控制能力。"
        ]
    },
    {
        "label": "1",
        "sentence": [
            " 计算机网络由资源子网和通信子网两层构成。资源子网提供共享资源和服务，通信子网负责数据传输和交换。数据通信技术是网络的基础。",
            " 数据通信是计算机信息技术的重要分支，研究计算机间使用数字信号进行通信的理论和方法。它由数据源、数据通信网和数据宿三部分组成，采用调制和解调的方式在传输信道上传输数据。",
            " 传输信道分类：物理/逻辑，模拟/数字，有线/无线，专用/公共交换。 常用传输媒体：双绞线，同轴电缆，光纤，无线电。",
            " 计算机网络包括计算机、通信线路、网络协议和应用软件，实现资源共享和信息传递。",
            " 计算机网络发展历程：诞生、形成、标准化、高速发展。单机远程联机、多主机互联分组交换网->统一标准开放式网络->高速互联、智能全球化互联网。网络技术进步、应用扩展。",
            " 计算机网络提供服务：文件、打印、邮件、因特网、通信连接和网络管理，提高工作效率，促进网络应用发展，网络管理关键。",
            " 计算机网络主要性能指标：速率、带宽、吞吐量、时延。指标相互关联，决定网络性能和质量。",
            " 网络总时延由发送、传播、处理和排队时延组成，分析可优化网络性能。",
            " 计算机网络通信需双方使用相同网络协议。采用分层模型简化协议设计，目前广泛使用的是TCP/IP。",
            " 局域网是最常见的计算机网络，覆盖范围小、速率高、可靠性高，广泛应用于各行各业。以太网是使用最广泛的局域网技术，传输速率不断提高。",
            " 随着需求增加,局域网不能满足远程需求。网络互连技术连接局域网为更大范围的广域网，覆盖更广阔地理区域。因特网是全球最大的广域网，实现了信息共享。网络技术在各领域发挥重要作用。",
            " 互联网是全球性计算机网络系统，允许人们通信和共享信息，涉及多领域，不断发展并赋予新内涵。",
            " Internet 由物理网络和通信协议组成，物理网络由计算机和传输介质构成，服务器通过高速线路连接，客户机通过中低速线路与 ISP 相连。通信协议包含 TCP/IP 协议和涉及的网络层、传输层和应用层。",
            " IP地址用32位二进制数字表示，采用点分十进制。IP地址由网络ID和主机ID组成，使用子网掩码划分。域名系统(DNS)管理域名与IP地址的对应关系。 DNS服务器将域名解析为相应的IP地址。",
            " URL用于标识互联网资源，TCP/IP协议传输数据，TCP负责可靠性，IP负责传输。数据分成包传输，经不同路径到达目的地，TCP处理数据问题。",
            " Internet提供多种信息服务，如电子邮件等。邮件是使用最广泛的服务，具有快速、简便等优点。服务遵循协议，由传送代理和用户代理两个程序共同实现。",
            " Internet提供了电子邮件、万维网、文件传输等服务，其中，万维网是规模最大的服务，用于信息发布和查询、电子商务、数字教育等，基于HTML、HTTP标准，采用客户机/服务器工作模式。",
            " Internet 提供多种常用服务，包括电子邮件、万维网、文件传输、电子公告板等。FTP 允许用户在计算机间传输文件，支持多种文件格式。BBS 是重要的信息服务平台，用户可远程登录进行资源共享、交流讨论等。",
            " Internet提供了电子邮件、万维网、文件传输、电子公告板、网络新闻、即时信息服务等。网络新闻提供讨论交流，即时信息服务以微信和QQ等软件实现通信。",
            " Internet提供的服务：邮件、万维网、文件传输、公告板、新闻、远程登录（Telnet）、网络游戏。"
        ]
    },
    {
        "label": "2",
        "sentence": [
            " 大数据技术需要采集和预处理数据。",
            " 数据采集包括明确需求和选择方法两环节，主要有人工和自动两类方法。应根据应用场景选择适当方法，为后续分析工作奠定基础。",
            " 常见的数据采集方法包括搜索引擎、爬虫和网络调查问卷三种。搜索引擎通过索引网页信息提供关键词搜索,但需要筛选可信数据;爬虫能快速获取网络数据,但需遵守相关法律法规;网络调查问卷可以获取网上不存在的数据。这些方法各有优缺点,在实际应用时需结合具体需求选择合适的方法。 - 数据采集方法：搜索引擎、爬虫、网络调查问卷。",
            " 采集到的原始数据需进行数据预处理，包括去重、补全缺失和校正错误等操作，确保数据质量，为后续分析工作奠定基础。",
            " 数据处理和分析是日常生活中常见的行为，使用电子表格软件可以方便地处理不同形式的数据，本节以Excel为例介绍相关操作，适用于各种类型的数据。",
            " 电子表格数据来源：手动输入、外部导入。数据类型：数值型、文本型、日期/时间型、逻辑型。输入时需注意格式：数值型右对齐、文本型设置文本格式、日期/时间需特定符号。掌握有利于后续数据处理与分析。",
            " Excel中的数据类型有数值型、文本型、日期/时间型和逻辑型。输入数据时需注意格式设置，如数值型右对齐、文本型设为文本格式、日期时间需使用特定符号。外部导入数据时可用Excel的'获取数据'功能，选择合适的分隔符。掌握这些基本技巧奠定数据处理基础。",
            " 在电子表格中，数据计算主要依赖公式和函数。公式以等号开始，包含数据、运算符和函数。函数是预定义的公式，根据参数计算并返回结果。数值型数据计算包括算术运算、关系运算和各种函数。掌握这些知识有助于进行复杂的数据分析。",
            " Excel常用函数包括：统计类、数学类和文本类函数，可用于计算总分、平均分、最高/低分和统计人数。文本型数据可用连接符&或文本函数进行处理。综合应用可完成更复杂的数据分析。",
            " 在Excel中提取公民身份号码中的出生年月日信息可以使用MID函数。日期时间型数据在Excel中以数值编码表示，可以使用日期时间函数如TODAY、DATEDIF、YEAR等进行计算和分析。通过这些函数可以完成不同需求下的数据处理任务。",
            " 在处理日期时间型数据时，可使用DATE函数将年月日数值转换为完整日期格式，再利用TODAY和YEAR函数计算学生年龄。处理逻辑型数据时，使用IF和AND函数进行条件判断，根据成绩评定学生等第。综合运用各数据函数，高效完成数据分析和处理任务。",
            " 数据分析中排序是重要基础操作。Excel支持单列简单排序，也支持多列复杂排序。排序可升序或降序，文本和逻辑数据有对应排序规则。默认排序不满足需求，可自定义排序顺序。排序有助组织和理解数据。",
            " 数据分析中，排序和筛选很有用。Excel有自动和高级筛选。需要注意不同数据类型和取消某些列的筛选。排序和筛选可以快速提取数据。",
            " 分类汇总是数据分析中常用的功能，可以将同一分类的数据合并统计，如求和、计数、求平均值等。操作时需要对数据排序，如果需要修改或取消分类汇总，可以通过分类汇总界面进行操作。分类汇总有助于更好地理解和分析数据。 输出结果：分类汇总常用于数据分析，有助于理解和分析数据。",
            " 数据分析的重要步骤：提取信息，采集、预处理、分析，描述现状、发现关系，预测未来，可视化呈现。综合应用技术有助于理解数据。",
            " 数据分析通过计算和方法提取有价值信息，发现数据特征和规律。常见方法包括对比、平均和结构分析，用于描述现状、对比差异，揭示关系。合理运用有助于更好地理解和分析数据。",
            " 数据可视化意图生动直观地表达数据信息，常用表现形式为条形图、柱形图和折线图等，能清晰展示数据分布和变化趋势，有助于快速抓住数据要点，提高信息传递效率和吸引力。",
            " 数据可视化包括多种表现形式，如散点图、饼图、环形图、雷达图和词云图等，能展示数据的关系、结构比例和变化趋势。不同方式各有优势，适用于不同数据类型和维度。使用时应选择合适形式，保持简明视觉效果。多种可视化手段有助于传达数据分析结果和洞见。",
            " 算法是解决问题的步骤描述，可是计算公式或完成工作的流程。",
            " 算法是一系列明确定义的步骤和规则，可以解决特定问题，可以广泛存在于日常生活中。抽象出算法可以使问题处理更精确有序，而在计算机中使用算法，需要将算法输入计算机以执行。认识算法可以提高解决问题的能力。",
            " 数据类型: 数值类型(整型、浮点型、布尔型、复数)、序列类型(字符串、列表、集合)和字典类型。 灵活表达和处理不同种类的数据。"
        ]
    },
    {
        "label": "3",
        "sentence": [
            " 物联网：基于互联网，通过信息传感设备实现人、机、物互联互通，提供智能化服务系统。",
            " 物联网（IoT）是由比尔·盖茨和麻省理工学院研究提出，2005年被国际电信联盟正式提出，依赖射频识别、传感器、纳米和嵌入式技术。",
            " 物联网核心：物与物、人与物信息交互。主要特征：整体感知、可靠传输、智能处理。功能：获取、传送、处理、施效信息。",
            " 物联网核心技术：RFID和传感器。RFID实现准确跟踪和成本节省。传感器感知外界环境信息并转换成电信号，应用于监控保护等领域。",
            " M2M是机器间交互网络应用，包含机器、硬件、通信、中间件和应用。云计算整合多个计算实体，为用户提供强力计算服务。物联网数据可通过云计算进行处理。",
            " 物联网推动基础设施、生活服务等智能化发展，提高资源利用效率和生活质量。军事领域中，物联网技术应用提升军事智能化、信息化和精确度，是未来军事变革关键。",
            " 物联网在智能交通和智慧农业领域有广泛应用。在交通领域，物联网可用于实时监控道路状况、自动收费、公交管理等，缓解交通拥堵问题;在农业领域，物联网可实现生产环境的智能感知、预警和决策管理，提高农业生产效率和质量。",
            " 物联网在智能家居、公共安全等领域广泛应用，提升生活便利性并保护安全。物联网技术对改善人类生活环境和国民经济发展产生深远影响。"
        ]
    },
    {
        "label": "4",
        "sentence": [
            " 算法具有五大特性: 有穷性、确切性、输入、输出和可行性。",
            " 描述算法的常见方式有自然语言、流程图和伪代码。三种方式各有优缺点，适用于不同场景。",
            " 算法描述方法：自然语言、流程图、伪代码。适用于表达算法功能的伪代码，不涉及具体编程语言。需要计算机执行算法时，使用编程语言如Python等高级语言。选择合适的描述方式根据具体需求。",
            " Python可用于实现各种算法，如计算靶心率范围和判断闰年。算法描述方法包括自然语言、流程图、伪代码和编程语言，适用于不同需求。简单算法可用自然语言，复杂算法用流程图或伪代码，需计算机执行的用编程语言。选择合适的描述方法，有助于更好地理解和表达算法。",
            " Python中常见的数据类型及其运算方式，以及针对不同数据需要定义不同数据类型。 → Python中数据类型及其运算方式，不同数据需要定义不同数据类型。",
            " Python中常见的运算符有算术运算符、逻辑运算符、关系运算符和赋值运算符。运算符连接成表达式进行数据运算，需遵循优先级规则。除法和求余运算时，除数不能为零，否则会抛出异常。",
            " 交通信号灯工作流程转为计算机程序算法。程序设计包括问题分析、算法设计、程序编写。Python简单易学、可扩展，用于数据分析、网络开发等。",
            " Python编程基础: 搭建环境、输入输出、常量变量、赋值、自运算。控制结构用于解决问题，是学习Python的重要基础。",
            " 本文强调了Python编程环境的重要性。",
            " Python官网下载，选择版本安装，找到帮助文档。",
            " 在Windows系统中，通过'开始'菜单运行IDLE集成开发环境，可以编写、运行Python程序，显示Python版本和'>>>'提示符。 → 在Windows系统中，通过'开始'菜单运行IDLE集成开发环境，编写、运行Python程序，显示Python版本和'>>>'提示符。",
            " IDLE提供文本编辑器功能，用于编写Python程序。编写完成后，保存并运行程序。Python自动编译为字节码文件(.pyc)。",
            " 程序接收输入数据，处理后输出结果，与外部世界交互。本节介绍Python的输入输出方法。",
            " 本节介绍Python基本语法,如语句结构和缩进格式。演示Python的输入输出、算术运算和内置函数。提高程序的灵活性和可读性。",
            " Python内置函数input()输入输出基本操作和IDLE颜色元素含义。返回值为字符串类型。示例包括单次/多次输入和类型转换。",
            " Python中的input()函数可以接受多个输入值，用逗号或空格分隔。map()函数可以将字符串转换为整数。在程序中，需要使用print()函数输出计算结果。",
            " 介绍了Python中print()函数输出结果的基础，包括输出单个字符串或数值、多个输出值之间使用逗号连接和将变量与字符串拼接输出。",
            " 介绍了Python中print()函数的更多输出格式，包括逗号分隔多个输出结果、不换行输出和格式化字符串。",
            " Python数据分为常量和变量，都占用内存空间。",
            " Python常量：数字、字符串、布尔值等。变量：存储临时数据，可多次赋值且无需声明类型。常量与变量不同之处在于常量值不可修改。",
            " 赋值语句：变量=表达式，非法标识符导致程序错误。",
            " 通过示例演示了Python中变量的定义规则和赋值特点。Python是动态语言，变量类型由赋值决定，无需提前声明。同一变量可以赋予不同类型的值。",
            " 本节探讨了Python中变量的使用特点，包括类型转换和关键字概念，并介绍了如何用变量解决实际问题。",
            " 通过计算阶乘演示Python中变量自运算语句及自运算符写法，让程序更加简洁高效。"
        ]
    },
    {
        "label": "5",
        "sentence": [
            " 人类社会发展与技术进步紧密相连。信息技术的发展推动了信息社会时代的到来，对政治、经济、社会、文化等领域产生深远影响，改变着人们的生活、工作和学习方式。信息技术不断进步，推动着信息社会的变革和发展。",
            " 古代信息技术：语言、文字、印刷术；近代信息技术：电信革命；现代信息技术：计算机、互联网。",
            " 本文介绍古代信息加密方法与现代信息技术的发展。",
            " 近代信息技术发展经历了电信革命。1837年莫尔斯发明了电报机，开启了信息技术新时代。贝尔发明电话机，马可尼和波波夫进行了无线电传输实验，推动了有线和无线电通信的发展。电信革命奠定了信息技术基础，推动了近代信息社会形成。",
            " 20世纪40年代，计算机诞生，开启信息技术革命。经历四代发展，符合摩尔定律，影响社会各方面。",
            " 信息技术是社会创新变革的推动力，主要体现为技术融合、网络移动和智能化。互联网+代表信息技术与传统产业融合，有助于增强创新能力。信息技术将持续影响社会进步。",
            " 信息技术发展趋势：集中化、大数据化、智能化、个性化；关键技术：云计算、虚拟化、大数据、人工智能；人脸识别系统综合多项核心技术。",
            " 信息技术与工业化深度融合，促进产业创新，使人类社会进入信息社会，信息社会以信息活动为基础，包括人人可创造、获取、使用和分享信息，实现可持续发展和生活质量提高，信息社会建设旨在缩小数字鸿沟，促进全面均衡发展。",
            " 信息社会可持续发展，重要资源为信息和知识，知识创新关键。以信息活动为基础的新型社会形态。"
        ]
    },
    {
        "label": "6",
        "sentence": [
            " 数据、信息和知识是三个相互联系的概念。数据描述客观事物属性; 信息是有意义的数据; 知识是更高级抽象且普适的信息。",
            " 信息具有可处理性、时效性、真伪性和价值相对性等特点。信息可被加工处理以产生新的信息,但需及时反映事物最新状态。信息的真伪需被甄别,其价值则取决于使用者的需求和利用能力。",
            " 数据是原始记录，信息是加工后的有意义内容，知识是更高级抽象概念，如观测行星运动得数据，分析得行星轨迹信息，归纳定律体现认知发展。",
            " 本单元学习信息技术的发展历程、趋势、信息社会内涵、特征、信息系统组成、功能、应用，数字社会概念、特征。全面掌握信息技术和信息系统的发展与应用。",
            " 信息系统由计算机硬件、软件、网络、数据和用户组成，用于信息的采集、传递、存储、检索、控制和显示。广泛应用于工作、学习和生活中，如办公自动化、网络购物、在线学习等。",
            " 信息系统由五个主要部分组成:硬件、软件、网络、数据和用户。用户需要具有信息安全意识,养成规范的使用习惯。",
            " 信息系统在各领域广泛应用，具有输入、存储、处理、输出和控制等功能，为用户提供决策支持。",
            " 信息系统广泛应用于社会各领域,提高效率,协助危险环境工作。",
            " 现代信息系统由计算机系统构成，包括硬件系统和软件系统。硬件是物质基础，软件则包含程序与数据。二者相互依存，共同组成计算机系统，对社会产生深刻影响。",
            " 程序设计语言分为三类:机器语言、汇编语言和高级语言。高级语言克服了低级语言的缺点,易学易用、可读性好、表达能力强、通用性好。主流高级语言包括C、C++、Java、C#、Python、Fortran等。高级语言的发展提高了程序开发的效率和可移植性。",
            " 服务性程序（支撑软件）为用户提供了方便的计算机使用环境和开发工具。",
            " DBMS是用于建立、使用和维护数据库的大型软件,提供DDL和DML,实现数据存储、修改、查询等功能,管理数据库的运行和维护。",
            " 常见的DBMS包括Oracle、MySQL、SQL Server、DB2和Access等，其中Oracle、MySQL和SQL Server具有市场份额较大的主流DBMS。 DB2和Access更适用于中小型应用场景。",
            " 应用软件是为解决特定领域实际问题而开发的计算机软件。主要包括文字处理、电子表格、辅助设计、用户应用程序和实时控制等类型。这些软件广泛应用于办公、设计、制造等领域。",
            " Equifax公司2017年发生数据泄露,导致1.47亿用户信息遭泄露。提醒保护个人隐私和数据安全。",
            " 社会信息道德规范人们的思想和行为，包括信息道德意识、信息道德关系和信息道德活动，维系人与人之间的信息关系。",
            " 信息安全法涉及各方面,具有指引评判预测教育强制功能。立法应平衡兼顾。"
        ]
    },
    {
        "label": "7",
        "sentence": [
            " 加密技术是通信双方按法则进行信息变换的保密技术，包括明文转密文和密文恢复明文两个过程。主要元素包括算法和密钥，密钥可分为对称密钥和非对称密钥，对应的加密技术为对称加密和非对称加密。",
            " 对称加密：发送和接收方使用相同的密钥加密解密。速度快、保密度高，但存在密钥传输和管理难题，无法实现数字签名认证。",
            " 非对称式加密算法通信双方使用不同密钥，甲用乙的公钥加密，乙用自己的私钥解密。RSA算法是非对称式加密算法的代表。",
            " DES是一种对称密钥加密算法，经历了计算机性能提升而被突破。AES是替代DES的新密码算法，具有密钥长度可选和加解密结构不同的特点，更加安全可靠。 缩减后：DES是对称密钥加密算法，被突破。AES是替代DES的新密码算法，更加安全。",
            " RSA是公钥密码体制，保密强度随密钥长度增加而增强。密钥越长，加密解密时间越长。",
            " 哈希算法是单向密码体制,将任意长度输入映射成固定长度输出,常用于消息摘要和签名,保护密码和数据安全。",
            " 数字签名是非对称加密技术与数字摘要技术的应用，保证了文件传输的安全性。"
        ]
    },
    {
        "label": "8",
        "sentence": [
            " 数字化将信息转为计算机处理的数据和编码，随着技术发展，生活中的事物、语言等被记录，改变人们的方式，推动社会发展。",
            " 编码将信息转为可识别符号，如身份证号、学号，编码是信息管理基础。",
            " 进位计数制是按进位方式计数，包括基数、数码和位权，常见有十进制、二进制、十六进制。计算机用二进制存储，软件工程用十六进制提高可读性。",
            " 常见的进位计数制包括十进制、二进制、十六进制等。不同进制间的相互转换包括:其他进制转十进制时,各位数码乘以对应位权再求和;十进制转其他进制时,整数部分除以新进制基数取余倒序,小数部分乘以新进制基数取整正序。借助计算器等工具可方便地实现不同进制数值的转换。",
            " 二进制是计算机数据存储的基础，字节是基本单位（B、KB、MB、GB等），数值数据转换为二进制编码存储，1字节表示0-255整数，2字节表示0-65535整数。计算机利用二进制编码存储和处理数据。",
            " 计算机将文本数据转换为二进制编码存储，英文字符用ASCII编码，7位二进制表示一个字符，可表示128个字符，包括数字、大小写字母和控制字符。ASCII码扩展增加了更多字符，包括表格符号和计算符号，与原ASCII码相比，扩展ASCII码编码长度更长，可表示的字符范围更广。",
            " 汉字编码：汉字用两个字节表示，GB2312编码，Unicode编码：17组平面，1114112码位，通用字符编码标准。",
            " 声音数字化=采样+量化+编码，采样频率和量化位数是质量影响因素，数字化使声音可存储和处理。",
            " 音频编码：波形、参数、混合。WAV、MP3等格式，各有优缺点。影响音频质量指标：采样频率、量化位数、声道数。",
            " 数字图像分为位图和矢量图，位图通过采样和量化生成像素数据，并使用RGB模型表示，文件格式包括GIF、BMP、JPEG，数据量由分辨率和色彩深度确定。",
            " 矢量图：数学公式描述图形，任意缩放不失真，文件大小与对象数量和复杂度有关。视频：由图像组成，需采集转换为电信号记录，同时需压缩减小数据量，数字化过程类似声音和图像。",
            " 数据压缩重新编码减少数据量，提高存储和传输效率，适用于图像、音频和视频文件。利用数据冗余消除信息并减小数据量。",
            " 数据压缩分为无损压缩和有损压缩两种。无损压缩不丢失信息，如行程编码；有损压缩可大幅压缩，适用于图像音频等，但损失部分信息。压缩性能指标包括压缩比、速度和数据质量，需权衡取舍。数据压缩可提高存储传输效率。"
        ]
    },
    {
        "label": "9",
        "sentence": [
            " 缩减后的结果：本节通过案例和操作体验人工智能技术，让读者更好地理解和应用。",
            " 关键词提取是文本挖掘的基础，应用于信息检索、摘要生成和文档分类。通过在线平台体验，获得关键词及其重要性。",
            " MNIST手写数字数据集，60,000个训练样本和10,000个测试样本。用于算法实现数字准确识别，通过神经网络批量训练评估分类准确性。",
            " 介绍了手写数字识别的准备工作，包括导入第三方库、设置输入层和输出层维度，使用 PyTorch 进行神经网络的创建和训练。",
            " PyTorch提供了加载MNIST数据集的功能，可通过DataLoader模块输入神经网络进行训练。训练集前9张图像展示了手写数字的样子。",
            " 创建人工神经网络模型，包括输入层、两个隐藏层和输出层，采用ReLU函数作为激活函数，旨在解决手写数字识别任务，输入层784，隐藏层256、64，输出层10。",
            " PyTorch库中交叉熵损失函数降低手写数字识别误差,Adam优化算法使计算更高效。训练时批量输入训练集,前向传播计算损失,反向传播更新网络参数。",
            " 手写数字识别训练过程，包括2个周期的损失函数值变化，逐步下降，模型学习效果提高。",
            " 利用测试集对训练好的人工神经网络模型进行准确率测试。准确率为96.6%。",
            " 可以通过识花君小程序拍摄未知花朵并识别其种类。网易有道词典App可以实现即时对话翻译。"
        ]
    },
    {
        "label": "10",
        "sentence": [
            " 数据是信息社会中重要资源，从古至今形式不断发展并广泛应用于各领域，但需加工解释才有实际意义。",
            " 信息从数据中提取，具有重要作用和多种特征，人们通过获取信息做出决策，如气象部门发布预警信息。",
            " 大数据渗透社会各领域，影响信息获取、决策和社会发展，改变人们思维和生活方式。",
            " 大数据：海量、多样的数据集需要新的处理模式，发挥决策支持、洞见发现和流程优化潜能，是信息社会重要资源。",
            " 大数据：数据规模大、类型多样、处理速度快、价值密度低的4V特征。给传统数据处理带来挑战，但大数据技术支持快速处理海量数据，让人们能更好地管理和分析，挖掘价值。",
            " 大数据技术应用：政务管理、金融管理。政府部门利用大数据提高政务处理效率，建设智慧城市；金融业利用大数据进行精准营销、风险管控和欺诈分析。大数据为行业提供决策支持和管理手段。",
            " 大数据在各领域广泛应用，如电商、医疗、交通和教育。带来了创新与变革。",
            " 数字乡村计划引入数字技术促进农村现代化，带动农业、商贸和教育发展，提高农民生活品质。鼓励互联网企业进入农村，利用大数据和智能设备提高农业生产效率。信息技术正在推动数字社会到来。",
            " 信息社会特征：信息经济、网络社会、数字生活、在线政府。我国网络基建不断提高，5G全球领先。",
            " 信息社会的主要特征：在线政府和数字生活。在线政府实现了现代化的社会管理和公共服务。数字生活体现在生活工具、方式和内容数字化，改变了人们的工作、学习和生活方式。",
            " 数字社会发展迅速，人们成为数字公民，各领域出现智能服务平台，提高工作和学习效率，数字素养成为基本要求。",
            " 数字社会：跨域连接、行动自主、数据共享、高效协作。",
            " 数字经济以数据和信息为关键生产要素，以数字技术创新为核心驱动力。促进传统产业数字化转型，推动新型产业模式如数字零售、数字制造的发展。中国数字经济已成为国家经济发展战略的重要组成部分。",
            " 数字医疗是信息技术在医疗中的应用，包括设备网络化、医院信息化和个性化服务。提高诊疗质量，促进远程医疗和个性化健康管理。",
            " 数字教育利用信息技术推动教育变革，包括全过程的数字化和打破时空限制。中国积极推进教育数字化战略，建设学习型社会，数字化学习平台是重要支撑。",
            " 数字艺术是利用数字技术创作和呈现的新型艺术形式，包括数字电影、数字博物馆、AI绘画等。敦煌数字博物馆通过数字化展现文物永久保护。AI绘画引发创作性和产权等问题的讨论。"
        ]
    },
    {
        "label": "11",
        "sentence": [
            " 人工智能已广泛应用，定义及发展概述。",
            " 人工智能（AI）是模拟人类智能和行为的学科，旨在设计智能信息处理系统，包括知识工程、机器学习、机器感知和决策制定等领域。",
            " 人工智能研究始于20世纪40年代的可编程数字计算机发明，60年代和80年代有高潮，但也有低谷，前景预测不同。",
            " 20世纪40-50年代开始探讨制造人工大脑的可能性，1956年确立人工智能学科，达特茅斯会议上确定名称和任务，标志着人工智能的诞生。",
            " 计算机科学经历了黄金年代和第一次低谷。黄金年代取得了巨大成就，但之后的第一次低谷遇到了质疑和资金困难，原因是AI研究者对课题难度判断不准。尽管存在问题，但AI在逻辑编程、常识推理等领域仍有进展。",
            " 20世纪80年代初，专家系统开始广泛应用，AI研究热点。但到80年代中期，AI市场需求下降，专家系统维护费用高，实用性受限。1987年后，政府削减AI资助，日本'第五代计算机工程'未达预期，AI再次低迷。",
            " 人工智能研究逐步走出寒冬阶段，形成了多个分支，取得了重大突破，与计算机硬件技术相关。",
            " 我国人工智能迅速发展，政府出台支持政策，发表论文数量居世界第一，高校设立人工智能学院，发展前景看好。",
            " 大数据对人工智能的发展和增长产生了重大影响，促进了人工智能算法在更大、更多样化的数据集上的训练。企业也能利用大数据及人工智能算法来挖掘数据中的价值，优化运营，改善客户体验，并做出数据驱动的决策。",
            " 近年来，人工神经网络快速发展，推动了人工智能领域。模拟人类神经系统，通过数据学习自适应，在图像识别、游戏等领域超越人类。但需大量计算和存储资源，如何利用现代软硬件技术确保人工智能进一步发展是关键。",
            " 计算机视觉是人工智能重要研究方向，通过数字图像/视频处理实现目标跟踪、识别和测量，解决识别、运动检测、场景重建和图像恢复等问题，应用广泛，如车牌识别、人体姿态识别、指纹识别、火灾监测等。",
            " 自然语言处理是人工智能和语言学的分支，包括认知、理解、生成，应用有语音识别、语音合成和机器翻译，效果需要提高。"
        ]
    },
    {
        "label": "12",
        "sentence": [
            " 二进制数制的优点：1) 物理实现简单，0和1表示电子元器件的稳定状态；2) 算术规则简单，加法和乘法操作直接；3) 逻辑运算方便，与布尔代数相符；4) 抗干扰能力强，即使受干扰也可靠辨别。这些特点使二进制成为计算机数据处理的最佳选择。",
            " 冯•诺依曼体系结构是现代通用计算机的基础。",
            " 冯•诺依曼体系结构计算机工作过程：输入程序和数据存储器，控制器取指令并译码，指令控制存储器和运算器操作，结果存储在内存，输出设备输出计算结果。计算机不断取指令、分析指令、执行指令。",
            " 计算机硬件：运算器、控制器、存储器、输入设备和输出设备。中央处理器(CPU)是核心部件，控制计算机工作，是计算机的'大脑'。",
            " CPU由运算器和控制器两部分组成,主要功能包括指令控制、操作控制、时间控制和数据加工。其中控制器负责从内存读指令、分析、执行、改变顺序、控制输入输出和处理异常。",
            " 计算机硬件包括5大部件，运算器和控制器组成CPU。CPU功能有指令、操作、时间控制和数据加工。控制器从内存读取指令、执行并控制输入输出。运算器处理算术逻辑。CPU参数如主频、外频、高速缓存反映性能。比较不同笔记本CPU可了解各品牌发展趋势。",
            " 计算机存储系统分为内存和外存两大类，分层设计可兼顾速度和容量。",
            " CPU集成2-3级高速缓存，速度受命中率影响。缓存级别越高，速度越慢。容量:128K-32M。",
            " 内存分为RAM和ROM。RAM有SRAM和DRAM，前者速度快但成本高，后者成本低但需要刷新。ROM有PROM、EPROM和EEPROM，以及速度最快的闪存。在计算机系统中广泛应用，手机采用ROM作为存储，RAM作为内存。",
            " 本地存储包括机械硬盘和固态硬盘，前者容量大但速度慢，后者速度快但价格高。混合配置可提高性能和性价比。移动和云存储提供便携和在线服务，满足不同需求。",
            " 存储设备主要性能指标为容量和内存频率，包括位(bit)、字节(Byte)、千字节(KB)、兆字节(MB)、吉字节(GB)和太字节(TB)。内存频率有核心频率、总线频率和传输频率，DDR内存传输频率是SDR的两倍。比较不同品牌内存的参数可了解性能差异。",
            " I/O设备是计算机与外部世界通信的硬件，设备通过设备控制器与CPU通信，需要特定驱动程序控制。操作系统提供通用驱动，需安装专用驱动实现更多功能。",
            " 总线：计算机各功能部件间传输信息通信干线，分为数据、地址和控制总线。数据总线双向传输，位数对应处理器字长；地址总线单向传输地址，位数决定内存寻址空间；控制总线传输控制信号和时序。总线分为内部和外部两种，前者连接CPU内部部件，后者连接CPU与外设。理解不同总线可分析计算机硬件工作原理。",
            " 计算机系统由硬件和软件组成。软件连接用户和硬件系统，包括程序和文档。系统软件和应用软件为两大类。",
            " 系统软件包括操作系统、语言处理程序、服务性程序和数据库管理系统等。操作系统是最核心的，具有五大功能：CPU管理、作业管理、存储管理、设备管理和文件管理。常见操作系统有Windows、Linux、Mac OS、Android、iOS等。",
            " 语言处理程序有3种类型：汇编、编译、解释。机器语言是最低级语言，汇编语言需要汇编程序翻译成机器语言才能执行。"
        ]
    },
    {
        "label": "13",
        "sentence": [
            " 信息安全是保护计算机系统免受未经授权的访问和破坏的重要课题，掌握常用的安全技术，注重信息社会的责任与伦理。",
            " 信息安全：物理安全、网络安全、系统安全、应用安全。物理安全：保护设备免受自然灾害。网络安全：保护数据不被破坏、窃取。系统安全：操作系统和数据库的安全。应用安全：Web 和电子邮件安全。",
            " 计算机信息系统包括计算机、相关设备设施，通过身份识别、访问控制、安全审核、加密签名和病毒防范等方式实现逻辑安全。",
            " 计算机信息系统安全保护能力分为五个等级：用户自主保护级、系统审计保护级和安全标记保护级。通过身份鉴别、访问控制和安全标记等措施实现用户和信息资源的保护。",
            " 计算机信息系统安全保护能力分为5个等级。等级越高，安全保护能力越强。第四级要求建立形式化安全策略模型，加强鉴别机制和系统管理控制。第五级要求最低化系统复杂性，支持安全管理功能，并提供可靠的恢复机制。",
            " 信息系统安全需要身份验证确认用户身份。常见方式包括共享密钥、生物学特征和公开密钥加密算法。技术广泛应用于网络、BBS、维基百科等服务，以及工作、学习、科研等计算机系统。",
            " 访问控制是网络安全的关键策略,包括对用户身份的验证、控制策略的实现以及对访问行为的审计。主要目的是限制访问主体对客体的访问,从而保障数据资源的合法使用和管理。访问控制的三要素包括主体、客体和控制策略。 → 访问控制是网络安全的关键策略，包括身份验证、实施控制策略和审计访问行为，目的是限制主体对客体的访问，保障数据资源的合法使用和管理。三要素：主体、客体、控制策略。",
            " 防火墙可分为四类，包括包过滤型、应用网关型、服务防火墙和监控型，可阻挡恶意入侵，保障网络数据安全。技术进步使防火墙功能完善，企业内部网络应用越来越广泛。",
            " 计算机病毒具有传播性、隐蔽性、感染性,能给用户带来很大损失。",
            " 计算机病毒分类：依附媒体、算法和破坏程度。病毒发展需加强防范。",
            " 计算机病毒多种传播方式，进入系统会造成破坏，特点包括程序性、隐藏性、非授权运行。",
            " 计算机病毒具有隐蔽性、破坏性、传染性、寄生性等特征，需要构建全面的防御体系。",
            " 安装最新的杀毒软件、培养良好的上网习惯、增强信息安全意识、及时升级系统和应用软件补丁、隔离受病毒侵害的计算机。",
            " 网络安全法旨在保障网络安全、维护国家主权和公共利益、保护公民权益、确保网络系统安全、保护信息保密、防止网络攻击、促进信息化健康发展。"
        ]
    }
]